Hi @julienduchesne 


plan works in theory, but I now terraform wants to recreate the SA. Is this expected?

```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # grafana_cloud_stack_service_account.terraform has changed
  ~ resource "grafana_cloud_stack_service_account" "terraform" {
      ~ id          = "85" -> "opsstack:85"
        name        = "terraform"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # grafana_cloud_stack_service_account_token.terraform must be replaced
-/+ resource "grafana_cloud_stack_service_account_token" "terraform" {
      + expiration         = (known after apply)
      ~ has_expired        = false -> (known after apply)
      ~ id                 = "82" -> (known after apply)
      ~ key                = (sensitive value)
        name               = "terraform"
      ~ service_account_id = "85" -> "opsstack:85" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
Releasing state lock. This may take a few moments...
╷
│ Error: the Grafana client is required for this resource. Set the auth and url provider attributes
│ 
│   with grafana_dashboard.this["dashboards/Ops.Stack Overview.json"],
│   on dashboards.tf line 2, in resource "grafana_dashboard" "this":
│    2: resource "grafana_dashboard" "this" {
│ 
╵
Error: Terraform exited with code 1.
Error: Process completed with exit code 1.